# Learning SQL problems

In [5]:
# Set up and connect 

# libaries 
import sqlalchemy
import pandas as pd

# Connect to the database 
engine=sqlalchemy.create_engine('postgresql://Alt-Evelyn:superuser@localhost:5432/bank')

# test connection 
pd.read_sql_query("SELECT table_name FROM information_schema.tables LIMIT 15", engine)

          table_name
0            account
1            pg_type
2             branch
3           business
4           customer
5         department
6           employee
7         individual
8            officer
9            product
10       transaction
11  pg_foreign_table
12          pg_roles
13       pg_settings
14          schemata

## Exercise 6-2
Write a compound query that finds the first and last names of all individual customers
along with the first and last names of all employees.

In [14]:
pd.read_sql_query("""SELECT fname, lname 
                     FROM individual
                     UNION
                     SELECT fname, lname
                     FROM employee;""", engine)

       fname      lname
0      Paula    Roberts
1      Susan    Tingley
2   Samantha    Jameson
3      Cindy      Mason
4      Chris     Tucker
5    Richard     Farley
6      Frank    Portman
7       Rick     Tulman
8       Beth     Fowler
9      Sarah     Parker
10      John    Gooding
11      John    Hayward
12    Robert      Tyler
13  Margaret      Young
14   Charles    Frasier
15    Thomas    Ziegler
16   Theresa    Markham
17     Susan     Barker
18     Louis      Blake
19      John      Blake
20     James     Hadley
21     Susan  Hawthorne
22      John    Spencer
23      Jane   Grossman
24     Frank     Tucker
25     Helen    Fleming
26   Michael      Smith

## Exercise 6-3
Sort the results from Exercise 6-2 by the lname column.

In [15]:
pd.read_sql_query("""SELECT fname, lname 
                     FROM individual
                     UNION ALL
                     SELECT fname, lname
                     FROM employee
                     ORDER BY lname;""", engine)

       fname      lname
0      Susan     Barker
1      Louis      Blake
2       John      Blake
3    Richard     Farley
4      Helen    Fleming
5       Beth     Fowler
6    Charles    Frasier
7       John    Gooding
8       Jane   Grossman
9      James     Hadley
10     Susan  Hawthorne
11      John    Hayward
12  Samantha    Jameson
13   Theresa    Markham
14     Cindy      Mason
15     Sarah     Parker
16     Frank    Portman
17     Paula    Roberts
18   Michael      Smith
19      John    Spencer
20     Susan    Tingley
21     Chris     Tucker
22     Frank     Tucker
23      Rick     Tulman
24    Robert      Tyler
25  Margaret      Young
26    Thomas    Ziegler

## Exerise 8-1
Construct a query that counts the number of rows in the account table.

In [17]:
pd.read_sql_query("""SELECT COUNT(*) 
                     FROM account;""", engine)

   count
0     24

## Exercise 8-2
Modify your query from Exercise 8-1 to count the number of accounts held by each
customer. Show the customer ID and the number of accounts for each customer.

In [24]:
pd.read_sql_query("""SELECT cust_id, COUNT(account_id)
                     FROM account
                     GROUP BY cust_id
                     ORDER BY cust_id;""", engine)

    cust_id  count
0         1      3
1         2      2
2         3      2
3         4      3
4         5      1
5         6      2
6         7      1
7         8      2
8         9      3
9        10      2
10       11      1
11       12      1
12       13      1

## Exercise 10-1
Write a query that returns all product names along with the accounts based on that
product (use the product_cd column in the account table to link to the product table).
Include all products, even if no accounts have been opened for that product.

In [30]:
pd.read_sql_query("""SELECT p.product_cd, 
                            account_id,
                            cust_id, 
                            avail_balance
                     FROM product p
                     LEFT OUTER JOIN 
                     account a 
                     ON p.product_cd = a.product_cd;
                     """, engine)

   product_cd  account_id  cust_id  avail_balance
0         CHK         1.0      1.0        1057.75
1         SAV         2.0      1.0         500.00
2          CD         3.0      1.0        3000.00
3         CHK         4.0      2.0        2258.02
4         SAV         5.0      2.0         200.00
5         CHK         7.0      3.0        1057.75
6          MM         8.0      3.0        2212.50
7         CHK        10.0      4.0         534.12
8         SAV        11.0      4.0         767.77
9          MM        12.0      4.0        5487.09
10        CHK        13.0      5.0        2237.97
11        CHK        14.0      6.0         122.37
12         CD        15.0      6.0       10000.00
13         CD        17.0      7.0        5000.00
14        CHK        18.0      8.0        3487.19
15        SAV        19.0      8.0         387.99
16        CHK        21.0      9.0         125.67
17         MM        22.0      9.0        9345.55
18         CD        23.0      9.0        1500.00
19        CHK        24.0     10.0       23575.12
20        BUS        25.0     10.0           0.00
21        BUS        27.0     11.0        9345.55
22        CHK        28.0     12.0       38552.05
23        SBL        29.0     13.0       50000.00
24        MRT         NaN      NaN            NaN
25        AUT         NaN      NaN            NaN